// задание 1
const userAge = 20;
if(userAge<35)
console.log('ты пацан')
/*
  напиши ниже условие, которое выведет в консоль текст "ты пацан" 
  если userAge меньше 35
*/
// тут твой код


//задание 2
const isAdmin = false;
if(isAdmin!==true)
console.log('доступ запрещен')
/* 
  напиши ниже условие, которое выведет в консоль текст "доступ запрещен", 
  если значение константы isAdmin ложно
*/
// тут твой код


//задание 3
const password = "sherlock";
const realPassword = "holmes";
if(password===realPassword)
console.log("правильный пароль")
/* 
   напиши ниже условие, которое выведет в консоль текст "правильный пароль" 
   только в том случае, если значения констант password и realPassword совпадают.
*/   
// тут твой код


// задание 4
const myAge = "20";
if(typeof myAge === 'number')
console.log("Возраст указан верно")
/*
  напиши ниже условие, которое выведет в консоль текст "возраст указан верно" 
  только в том случае, если ТИПОМ переменной myAge является number.
  Тебе понадобится оператор typeof: https://learn.javascript.ru/types#type-typeof
*/
// тут твой код

// задание 5
const x = 2.7;
const y = -6;
if(x<y)
console.log('икс меньше игрек')
/*
  напиши ниже условие, которое выведет в консоль "икс меньше игрик" только 
  в том случае, если значение переменной x меньше, чем значение переменной y
*/
// тут твой код