// задание 1
const userAge = 20;
if(userAge<35)
console.log('ты пацан')
else {
    console.log("не по пацански")
}
/*
  напиши ниже условие, которое выведет в консоль текст "ты пацан" 
  если userAge меньше 35, иначе выведет текст "не по-пацански"
*/
// тут твой код


//задание 2
const isUser = false;
if(isUser===true)

 console.log("привет юзер")
else{
    console.log('не пользоватедь ты мне')
}

/* 
  напиши ниже условие, которое выведет в консоль текст "привет, юзер", если 
  значение константы isTrue истинно, иначе нужно вывести "не пользователь ты мне"
*/
// тут твой код


//задание 3
const password = "sherlock";
const realPassword = "holmes";
if(password===realPassword)
console.log('правильный пароль')
else{
    console.log("неверный пароль")
}
/* 
   напиши ниже условие, которое выведет в консоль текст "правильный пароль" 
   только в том случае, если значения констант password и realPassword совпадают,
   иначе необходимо вывести "неверный пароль".
*/   
// тут твой код


// задание 4 (со звездочкой)
const email = "admin@intocode.ru";
if(email.indexOf('@')!== -1 )
    console.log('ты зареган')
    else{
        'неверный email'
    }

/*
  напиши ниже условие, которое выведет в консоль текст "неверный эмайл" если
  в значении переменной email нет символа "@", иначе выведи "ты зареган"
  Тебе понадобится метод indexOf: https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/indexOf
*/
// тут твой код

// задание 5
const x = 2.7;
const y = -6;
if(x>y)
console.log(x)
else{
    console(y)
}
/*
  напиши ниже условие, которое выведет в консоль значение переменной x, если
  оно больше значения переменной y, иначе выведи значение переменной y
*/
// тут твой код